Repository: davidpovarsky/hanlin-ai
Catalog: AI_HLY/Downstream/RuntimeCore/Resources/RuntimeLocalizable.xcstrings
Source language: en
Languages: he, zh_hans

source: Compiling TypeScript
he: קומפילציית TypeScript
zh_hans: 正在编译 TypeScript

source: Compile TypeScript 6 and run the emitted JavaScript with Node.
he: קומפילציית TypeScript 6 והרצת ה־JavaScript שנוצר באמצעות Node.
zh_hans: 编译 TypeScript 6，并使用 Node 运行生成的 JavaScript。

source: Compile TypeScript with the pinned compiler and optionally execute it through the embedded Node runtime.
he: קומפילציית TypeScript באמצעות המהדר הנעול, עם אפשרות להריץ דרך Node המוטמע.
zh_hans: 使用锁定版本的编译器编译 TypeScript，并可通过嵌入式 Node 运行。

source: Copy output
he: העתקת הפלט
zh_hans: 复制输出

source: Duration: %d ms
he: משך: %d מ״ש
zh_hans: 耗时：%d 毫秒

source: Execution completed without output.
he: ההרצה הושלמה ללא פלט.
zh_hans: 执行完成，但没有输出。

source: Execution timeout from 1 to 300 seconds.
he: פסק זמן להרצה, בין שנייה אחת ל־300 שניות.
zh_hans: 执行超时范围为 1 至 300 秒。

source: Exit code: %d
he: קוד יציאה: %d
zh_hans: 退出代码：%d

source: Explicitly allow HTTPS network access for curl.
he: מתן הרשאה מפורשת לגישת HTTPS עבור curl.
zh_hans: 明确允许 curl 访问 HTTPS 网络。

source: JavaScript completed
he: הרצת JavaScript הושלמה
zh_hans: JavaScript 已完成

source: JavaScript failed
he: הרצת JavaScript נכשלה
zh_hans: JavaScript 执行失败

source: JavaScript source code.
he: קוד מקור ב־JavaScript.
zh_hans: JavaScript 源代码。

source: Local Python
he: Python מקומי
zh_hans: 本地 Python

source: Local Python completed
he: הרצת Python המקומי הושלמה
zh_hans: 本地 Python 已完成

source: Local Python failed
he: הרצת Python המקומי נכשלה
zh_hans: 本地 Python 执行失败

source: No output
he: אין פלט
zh_hans: 无输出

source: One command from the verified catalog; no pipes, redirection, substitution, or chaining.
he: פקודה אחת מהקטלוג המאומת; ללא צינורות, ניתוב, החלפה או שרשור.
zh_hans: 仅允许验证目录中的一条命令；不支持管道、重定向、替换或串联。

source: Optional script arguments.
he: ארגומנטים אופציונליים לסקריפט.
zh_hans: 可选脚本参数。

source: Python source code.
he: קוד מקור ב־Python.
zh_hans: Python 源代码。

source: Return diagnostics and emitted JavaScript without execution.
he: החזרת אבחונים ו־JavaScript שנוצר ללא הרצה.
zh_hans: 返回诊断信息和生成的 JavaScript，但不执行。

source: Run JavaScript on-device. Auto selects JavaScriptCore for simple code and Node for modules or Node APIs.
he: הרצת JavaScript במכשיר. מצב אוטומטי בוחר JavaScriptCore לקוד פשוט ו־Node למודולים או ממשקי Node.
zh_hans: 在设备上运行 JavaScript。自动模式对简单代码使用 JavaScriptCore，对模块或 Node API 使用 Node。

source: Run JavaScript with JavaScriptCore or the embedded Node worker runtime.
he: הרצת JavaScript באמצעות JavaScriptCore או סביבת Workers המוטמעת של Node.
zh_hans: 使用 JavaScriptCore 或嵌入式 Node Worker 运行 JavaScript。

source: Run one approved ios_system command in an isolated app workspace. This is not a Linux shell.
he: הרצת פקודת ios_system מאושרת אחת בסביבת עבודה מבודדת. זו אינה מעטפת Linux.
zh_hans: 在隔离的应用工作区中运行一条已批准的 ios_system 命令。这不是 Linux shell。

source: Run one structurally parsed command from the verified ios_system catalog.
he: הרצת פקודה אחת שנותחה מבנית מתוך קטלוג ios_system המאומת.
zh_hans: 运行一条经过结构化解析且来自已验证 ios_system 目录的命令。

source: Run Python code on-device with embedded CPython. This is separate from the remote Piston tool.
he: הרצת קוד Python במכשיר באמצעות CPython מוטמע. כלי זה נפרד מכלי Piston המרוחק.
zh_hans: 使用嵌入式 CPython 在设备上运行 Python。此工具与远程 Piston 工具分开。

source: Run Python locally with the embedded offline interpreter.
he: הרצת Python מקומית באמצעות המפרש המוטמע שפועל ללא אינטרנט.
zh_hans: 使用嵌入式离线解释器在本地运行 Python。

source: Running JavaScript
he: מריץ JavaScript
zh_hans: 正在运行 JavaScript

source: Running local Python
he: מריץ Python מקומי
zh_hans: 正在运行本地 Python

source: Running shell command
he: מריץ פקודת shell
zh_hans: 正在运行 shell 命令

source: Runtime execution failed
he: הרצת המנוע נכשלה
zh_hans: 运行时执行失败

source: Runtime selection.
he: בחירת מנוע הרצה.
zh_hans: 运行时选择。

source: Shell command completed
he: פקודת ה־shell הושלמה
zh_hans: Shell 命令已完成

source: Shell command failed
he: פקודת ה־shell נכשלה
zh_hans: Shell 命令失败

source: Timeout from 1 to 300 seconds.
he: פסק זמן בין שנייה אחת ל־300 שניות.
zh_hans: 超时范围为 1 至 300 秒。

source: TypeScript completed
he: הרצת TypeScript הושלמה
zh_hans: TypeScript 已完成

source: TypeScript compilation
he: קומפילציית TypeScript
zh_hans: TypeScript 编译

source: TypeScript failed
he: הרצת TypeScript נכשלה
zh_hans: TypeScript 失败

source: TypeScript source code.
he: קוד מקור ב־TypeScript.
zh_hans: TypeScript 源代码。

source: Virtual TypeScript file name.
he: שם וירטואלי לקובץ TypeScript.
zh_hans: 虚拟 TypeScript 文件名。

source: %d planned actions
he: %d פעולות מתוכננות
zh_hans: %d 个计划操作

source: Add
he: הוספה
zh_hans: 添加

source: Add Variable
he: הוספת משתנה
zh_hans: 添加变量

source: Additional execution environments
he: סביבות הרצה נוספות
zh_hans: 其他执行环境

source: App restart required
he: נדרשת הפעלה מחדש של היישום
zh_hans: 需要重新启动应用

source: Assistant access
he: גישת העוזר
zh_hans: 助手访问

source: Available inside the existing browser and canvas flows
he: זמין בתהליכי הדפדפן והקנבס הקיימים
zh_hans: 可在现有浏览器和画布流程中使用

source: Browser JavaScript / WebKit
he: JavaScript בדפדפן / WebKit
zh_hans: 浏览器 JavaScript / WebKit

source: Calculated after installation
he: יחושב לאחר ההתקנה
zh_hans: 安装后计算

source: Cancel
he: ביטול
zh_hans: 取消

source: Cancelled
he: בוטל
zh_hans: 已取消

source: Classification
he: סיווג
zh_hans: 分类

source: Clear reproducible caches
he: ניקוי מטמונים הניתנים לשחזור
zh_hans: 清除可重建缓存

source: Commands run in-process inside an app-scoped miniRoot. This is not Linux and there is no interactive terminal.
he: הפקודות רצות בתוך התהליך וב־miniRoot המוגבל ליישום. זו אינה סביבת Linux ואין מסוף אינטראקטיבי.
zh_hans: 命令在应用范围的 miniRoot 中进程内运行。这不是 Linux，也没有交互式终端。

source: Completed
he: הושלם
zh_hans: 已完成

source: Delete
he: מחיקה
zh_hans: 删除

source: Dependencies
he: תלויות
zh_hans: 依赖项

source: Disabled by default. Only one structurally parsed command from the verified catalog is accepted; pipes, redirection, substitution and chaining are rejected.
he: מושבת כברירת מחדל. מתקבלת פקודה אחת בלבד מן הקטלוג המאומת; צינורות, ניתוב, החלפה ושרשור נדחים.
zh_hans: 默认禁用。仅接受来自已验证目录的一条结构化解析命令；拒绝管道、重定向、替换和命令串联。

source: Downloading and verifying wheel
he: מוריד ומאמת חבילת wheel
zh_hans: 正在下载并验证 wheel

source: Edit Variable
he: עריכת משתנה
zh_hans: 编辑变量

source: Enable sensitive shell tool
he: הפעלת כלי shell רגיש
zh_hans: 启用敏感 Shell 工具

source: Enabled
he: מופעל
zh_hans: 已启用

source: Environment
he: משתני סביבה
zh_hans: 环境变量

source: Executing
he: מריץ
zh_hans: 正在执行

source: Failed
he: נכשל
zh_hans: 失败

source: Health Check
he: בדיקת תקינות
zh_hans: 运行状况检查

source: Import Probe
he: בדיקת import
zh_hans: 导入探测

source: Install
he: התקנה
zh_hans: 安装

source: Installed Python packages
he: חבילות Python מותקנות
zh_hans: 已安装的 Python 包

source: Installed global packages
he: חבילות גלובליות מותקנות
zh_hans: 已安装的全局包

source: Integrity
he: שלמות
zh_hans: 完整性

source: Last health check
he: בדיקת תקינות אחרונה
zh_hans: 上次运行状况检查

source: Lifecycle actions require explicit approval and are not run during the package transaction.
he: פעולות lifecycle דורשות אישור מפורש ואינן מופעלות במהלך עסקת החבילה.
zh_hans: 生命周期操作需要明确批准，且不会在包事务期间运行。

source: Lifecycle scripts
he: סקריפטי lifecycle
zh_hans: 生命周期脚本

source: Linked
he: מקושר
zh_hans: 已链接

source: Management
he: ניהול
zh_hans: 管理

source: Name
he: שם
zh_hans: 名称

source: Native or source distribution
he: הפצה מקורית או קוד מקור
zh_hans: 原生或源码分发

source: New value (leave blank to keep saved secret)
he: ערך חדש (יש להשאיר ריק כדי לשמור את הסוד הקיים)
zh_hans: 新值（留空以保留已保存的机密）

source: No global Node packages
he: אין חבילות Node גלובליות
zh_hans: 没有全局 Node 包

source: No local Python packages
he: אין חבילות Python מקומיות
zh_hans: 没有本地 Python 包

source: No runtime logs
he: אין יומני מנועים
zh_hans: 没有运行时日志

source: No variables in this scope
he: אין משתנים בתחום זה
zh_hans: 此作用域中没有变量

source: Node Packages
he: חבילות Node
zh_hans: Node 包

source: Node requirement
he: דרישת Node
zh_hans: Node 要求

source: None
he: ללא
zh_hans: 无

source: Not prepared
he: לא הוכן
zh_hans: 未准备

source: Not specified
he: לא צוין
zh_hans: 未指定

source: On-device runtimes
he: מנועים במכשיר
zh_hans: 设备端运行时

source: Open Details
he: פתיחת פרטים
zh_hans: 打开详情

source: Package
he: חבילה
zh_hans: 包

source: Package details
he: פרטי חבילה
zh_hans: 包详情

source: Package name
he: שם החבילה
zh_hans: 包名称

source: Packages are installed transactionally with npm lifecycle scripts disabled. Compatibility is reported per package; TypeScript packages with published JavaScript output are supported.
he: החבילות מותקנות בעסקה אטומית כאשר סקריפטי lifecycle של npm מושבתים. התאימות מוצגת לכל חבילה; חבילות TypeScript שמפרסמות פלט JavaScript נתמכות.
zh_hans: 软件包以事务方式安装，并禁用 npm 生命周期脚本。兼容性按包报告；支持发布了 JavaScript 输出的 TypeScript 包。

source: Piston Remote Python
he: Python מרוחק באמצעות Piston
zh_hans: Piston 远程 Python

source: Prepare
he: הכנה
zh_hans: 准备

source: Preparing
he: מכין
zh_hans: 正在准备

source: Preview
he: תצוגה מקדימה
zh_hans: 预览

source: PyPI package
he: חבילת PyPI
zh_hans: PyPI 包

source: Python Packages
he: חבילות Python
zh_hans: Python 包

source: Ready
he: מוכן
zh_hans: 就绪

source: Refresh
he: רענון
zh_hans: 刷新

source: Remote service · Python 3.10 · network required
he: שירות מרוחק · Python 3.10 · נדרש חיבור לרשת
zh_hans: 远程服务 · Python 3.10 · 需要网络

source: Requires explicit HTTPS network permission
he: נדרשת הרשאת רשת HTTPS מפורשת
zh_hans: 需要明确的 HTTPS 网络权限

source: Resolving and verifying package
he: פותר ומאמת את החבילה
zh_hans: 正在解析并验证包

source: Runtime logs
he: יומני מנועים
zh_hans: 运行时日志

source: Runtime tools
he: כלי מנועים
zh_hans: 运行时工具

source: Runtime-managed names such as HOME, PATH, TMPDIR, NODE_PATH, npm cache paths, PYTHONHOME and PYTHONPATH cannot be overridden.
he: לא ניתן לדרוס שמות המנוהלים בידי המנוע, כגון HOME, PATH, TMPDIR, NODE_PATH, נתיבי המטמון של npm,‏ PYTHONHOME ו־PYTHONPATH.
zh_hans: 无法覆盖由运行时管理的名称，例如 HOME、PATH、TMPDIR、NODE_PATH、npm 缓存路径、PYTHONHOME 和 PYTHONPATH。

source: Runtimes & Packages
he: מנועים וחבילות
zh_hans: 运行时与软件包

source: Save
he: שמירה
zh_hans: 保存

source: Saved in Keychain · value hidden
he: נשמר ב־Keychain · הערך מוסתר
zh_hans: 已保存到钥匙串 · 值已隐藏

source: Scope
he: תחום
zh_hans: 作用域

source: Secret value
he: ערך סודי
zh_hans: 机密值

source: Secrets are saved in Keychain and are never displayed again, logged, or included in diagnostics.
he: סודות נשמרים ב־Keychain ואינם מוצגים שוב, נרשמים ביומן או נכללים באבחון.
zh_hans: 机密信息保存在钥匙串中，之后不会再次显示、记录到日志或包含在诊断中。

source: Sensitive capability — review every command
he: יכולת רגישה — יש לבדוק כל פקודה
zh_hans: 敏感功能——请检查每条命令

source: Shared
he: משותף
zh_hans: 共享

source: Shell Capabilities
he: יכולות shell
zh_hans: Shell 功能

source: Smoke Test
he: בדיקת עשן
zh_hans: 冒烟测试

source: Source
he: מקור
zh_hans: 来源

source: Storage
he: אחסון
zh_hans: 存储空间

source: Treat as secret
he: שמירה כסוד
zh_hans: 作为机密处理

source: Unavailable
he: לא זמין
zh_hans: 不可用

source: Uninstall
he: הסרה
zh_hans: 卸载

source: Universal pure-Python wheel
he: חבילת wheel אוניברסלית ב־Python טהור
zh_hans: 通用纯 Python wheel

source: Universal pure-Python wheels can be installed. Source builds and arbitrary native extensions cannot be installed dynamically on iOS; a future release may add prebundled native modules.
he: ניתן להתקין חבילות wheel אוניברסליות ב־Python טהור. לא ניתן לבנות ממקור או להתקין דינמית הרחבות native שרירותיות ב־iOS; גרסה עתידית עשויה להוסיף מודולים native ארוזים מראש.
zh_hans: 可以安装通用纯 Python wheel。iOS 不支持动态安装源码构建或任意原生扩展；未来版本可能加入预捆绑的原生模块。

source: Update
he: עדכון
zh_hans: 更新

source: Value
he: ערך
zh_hans: 值

source: Verified commands
he: פקודות מאומתות
zh_hans: 已验证命令

source: Version
he: גרסה
zh_hans: 版本

source: Version (optional)
he: גרסה (אופציונלי)
zh_hans: 版本（可选）

source: Version or tag (optional)
he: גרסה או תגית (אופציונלי)
zh_hans: 版本或标签（可选）

source: ios_system runtime
he: מנוע ios_system
zh_hans: ios_system 运行时

source: npm package
he: חבילת npm
zh_hans: npm 包

source: Copy workspace files.
he: העתקת קבצים בסביבת העבודה.
zh_hans: 复制工作区文件。

source: Count lines, words, or bytes.
he: ספירת שורות, מילים או בתים.
zh_hans: 统计行、单词或字节。

source: Create links inside the workspace.
he: יצירת קישורים בתוך סביבת העבודה.
zh_hans: 在工作区内创建链接。

source: Create or extract archives in the workspace.
he: יצירה או חילוץ של ארכיונים בסביבת העבודה.
zh_hans: 在工作区中创建或解压归档。

source: Create or update workspace files.
he: יצירה או עדכון של קבצים בסביבת העבודה.
zh_hans: 创建或更新工作区文件。

source: Create workspace directories.
he: יצירת תיקיות בסביבת העבודה.
zh_hans: 创建工作区目录。

source: Filter repeated text lines.
he: סינון שורות טקסט חוזרות.
zh_hans: 过滤重复文本行。

source: Inspect a workspace link.
he: בדיקת קישור בסביבת העבודה.
zh_hans: 检查工作区链接。

source: Inspect workspace file metadata.
he: בדיקת מטא־נתונים של קובץ בסביבת העבודה.
zh_hans: 检查工作区文件元数据。

source: List workspace files.
he: הצגת קבצים בסביבת העבודה.
zh_hans: 列出工作区文件。

source: Move workspace files.
he: העברת קבצים בסביבת העבודה.
zh_hans: 移动工作区文件。

source: Process text with the linked BSD awk implementation.
he: עיבוד טקסט באמצעות מימוש BSD awk המקושר.
zh_hans: 使用已链接的 BSD awk 实现处理文本。

source: Read the beginning of workspace files.
he: קריאת תחילת הקבצים בסביבת העבודה.
zh_hans: 读取工作区文件开头。

source: Read the end of workspace files.
he: קריאת סוף הקבצים בסביבת העבודה.
zh_hans: 读取工作区文件末尾。

source: Read workspace files.
he: קריאת קבצים בסביבת העבודה.
zh_hans: 读取工作区文件。

source: Remove empty workspace directories.
he: מחיקת תיקיות ריקות בסביבת העבודה.
zh_hans: 删除空的工作区目录。

source: Remove one workspace link or file.
he: מחיקת קישור או קובץ אחד בסביבת העבודה.
zh_hans: 删除一个工作区链接或文件。

source: Remove workspace files.
he: מחיקת קבצים בסביבת העבודה.
zh_hans: 删除工作区文件。

source: Search text in workspace files.
he: חיפוש טקסט בקבצים שבסביבת העבודה.
zh_hans: 在工作区文件中搜索文本。

source: Sort text.
he: מיון טקסט.
zh_hans: 排序文本。

source: Transfer data over HTTPS when network access is approved.
he: העברת נתונים ב־HTTPS לאחר אישור גישה לרשת.
zh_hans: 在网络访问获批后通过 HTTPS 传输数据。

source: Transform text with BSD sed.
he: שינוי טקסט באמצעות BSD sed.
zh_hans: 使用 BSD sed 转换文本。

source: Translate text characters.
he: החלפת תווי טקסט.
zh_hans: 转换文本字符。
